EditorConfig.EditorConfig
Gruntfuggly.todo-tree
LaurentTreguier.uncrustify
PeterJausovec.vscode-docker
VisualStudioExptTeam.vscodeintellicode
alexdima.vscode-lcov
bierner.emojisense
bierner.markdown-emoji
bierner.markdown-preview-github-styles
bungcip.better-toml
dracula-theme.theme-dracula
eamodio.gitlens
esbenp.prettier-vscode
fallenwood.vimL
hoovercj.haskell-linter
ikappas.phpcs
justusadam.language-haskell
kumar-harsh.graphql-for-vscode
mauve.terraform
ms-python.python
ms-vscode.cpptools
ms-vscode.vscode-typescript-tslint-plugin
msjsdiag.debugger-for-chrome
neuron.neuron-IPE
persoderlind.vscode-phpcbf
quicktype.quicktype
richie5um2.vscode-sort-json
rust-lang.rust
shinnn.stylelint
sidneys1.gitconfig
timonwong.shellcheck
vscodevim.vim
wix.vscode-import-cost
