alsa-utils
anki
arandr
bash-completion
bluez
bluez-utils
clang
deluge
dmenu
docker
docker-compose
docker-machine
dunst
evince
feh
file-roller
filezilla
gimp
git
gnome-keyring
gnome-screenshot
go
go-tools
gparted
highlight
htop
hub
i3
i3lock
i3status
imagemagick
libreoffice-fresh
meld
networkmanager
network-manager-applet
nodejs
noto-fonts
noto-fonts-emoji
$nvidia
$nvidia-libgl
openssh
parted
pep8
pulseaudio
pulseaudio-bluetooth
python
python-pip
python2
python2-pip
redshift
reflector
rofi
rsync
ruby
rxvt-unicode
shellcheck
shotwell
simplescreenrecorder
task
texlive-most
time
tmux
ttf-dejavu
ttf-hack
ttf-inconsolata
udiskie
unzip
vim
vlc
w3m
wget
xclip
@xf86-input-libinput
@xf86-video-intel
@xorg-xinput
xorg-server
xorg-server-utils
xorg-setxkbmap
xterm
zip
