arandr
bash-completion
clang
deluge
dmenu
docker
docker-compose
evince
file-roller
filezilla
git
gnome-screenshot
go
go-tools
google-chrome-beta
gparted
highlight
i3
i3lock
i3status
imagemagick
libreoffice-fresh
meld
network-manager-applet
nodejs
nvidia
nvidia-libgl
parted
pep8
pulseaudio
pulseaudio-bluetooth
python
python-pip
python2
python2-pip
redshift
rsync
ruby
rxvt-unicode
shotwell
simplescreenrecorder
task
texlive-most
time
ttf-dejavu
ttf-hack
unzip
vim
vlc
wget
xclip
xdotool
xorg-server
xorg-server-utils
xorg-setxkbmap
zip
