tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "manifoldco/brew"
tap "zaquestion/tap"
# Apache Portable Runtime library
brew "apr"
# SSL/TLS cryptography library
brew "openssl"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Record and share terminal sessions
brew "asciinema"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Portable Foreign Function Interface library
brew "libffi"
# Archival front-end
brew "atool"
# Automatic configure script builder
brew "autoconf"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.1+
brew "bash-completion@2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Top-like interface for container metrics
brew "ctop"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# YAML Parser
brew "libyaml"
# Isolated development environments using Docker
brew "docker-compose"
# Create Docker hosts locally and on cloud providers
brew "docker-machine", restart_service: true
# Command-line tool for DigitalOcean
brew "doctl"
# Maintain consistent coding style between multiple editors
brew "editorconfig"
# Command-line tool to interact with exercism.io
brew "exercism"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Collection of GNU find, xargs, and locate
brew "findutils", args: ["with-default-names"]
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU awk utility
brew "gawk"
# GNU compiler collection
brew "gcc"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# Command-line option parsing library
brew "gnu-getopt"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU implementation of which utility
brew "gnu-which"
# Asynchronous event library
brew "libevent"
# ASN.1 structure parser library
brew "libtasn1"
# Low-level cryptographic library
brew "nettle"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU grep, egrep and fgrep
brew "grep"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# The Haskell Tool Stack
brew "haskell-stack"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Add GitHub support to git on the command-line
brew "hub"
# Json incremental digger
brew "jid"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# LastPass command-line interface tool
brew "lastpass-cli"
# Utility for directing compilation
brew "make", args: ["with-default-names"]
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility for managing network connections
brew "netcat"
# Platform built on V8 to build network applications
brew "node"
# Swiss-army knife of markup format conversion
brew "pandoc"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Show ps output as a tree
brew "pstree"
# Interpreted, interactive, object-oriented programming language
brew "python@2", link: false
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Version control system designed to be a better CVS
brew "subversion"
# Feature-rich console based todo list manager
brew "task"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Source code beautifier
brew "uncrustify"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Lab wraps Git or Hub, making it simple to clone, fork, and interact with repositories on GitLab
brew "zaquestion/tap/lab"
cask "alfred"
cask "atom-beta"
cask "bartender"
cask "dash"
cask "dropbox"
cask "firefoxdeveloperedition"
cask "flux"
cask "google-chrome-canary"
cask "haskell-platform"
cask "iterm2"
cask "karabiner-elements"
cask "key-codes"
cask "keybase"
cask "libreoffice"
cask "logitech-myharmony"
cask "mactex-no-gui"
cask "ngrok"
cask "postman"
cask "qlcolorcode"
cask "qlmarkdown"
cask "quicklook-csv"
cask "quicklook-json"
cask "sketch"
cask "sketchpacks"
cask "skim"
cask "slack"
cask "spotify"
cask "transmission"
cask "visual-studio-code"
cask "vmware-horizon-client"
cask "windscribe"
mas "com.atlassian.trello", id: 1278508951
mas "com.crowdcafe.windowmagnet", id: 441258766
mas "com.eltima.tp2", id: 970502923
mas "com.gingerlabs.NotabilityMac", id: 736189492
mas "com.if.Amphetamine", id: 937984704
