alefragnani.project-manager
alexdima.vscode-lcov
bierner.emojisense
bierner.markdown-checkbox
bierner.markdown-emoji
bierner.markdown-mermaid
bierner.markdown-preview-github-styles
blanu.vscode-styled-jsx
bmewburn.vscode-intelephense-client
bungcip.better-toml
dbaeumer.vscode-eslint
dracula-theme.theme-dracula
eamodio.gitlens
EditorConfig.EditorConfig
eg2.tslint
esbenp.prettier-vscode
fallenwood.vimL
geddski.macros
hoovercj.haskell-linter
hoovercj.vscode-settings-cycler
junstyle.php-cs-fixer
justusadam.language-haskell
kisstkondoros.vscode-codemetrics
kumar-harsh.graphql-for-vscode
LaurentTreguier.uncrustify
ms-python.python
ms-vscode.cpptools
PeterJausovec.vscode-docker
richie5um2.vscode-sort-json
rust-lang.rust
shinnn.stylelint
SirTobi.pegjs-language
sysoev.language-stylus
timonwong.shellcheck
Tyriar.sort-lines
vscodevim.vim
vtfn.stylint
WallabyJs.quokka-vscode
wayou.vscode-todo-highlight
wix.vscode-import-cost
