alefragnani.project-manager
alexdima.vscode-lcov
bierner.markdown-emoji
bierner.markdown-mermaid
bierner.markdown-preview-github-styles
blanu.vscode-styled-jsx
bungcip.better-toml
dbaeumer.vscode-eslint
djabraham.vscode-yaml-validation
donjayamanne.githistory
donjayamanne.python
dracula-theme.theme-dracula
EditorConfig.EditorConfig
eg2.tslint
esbenp.prettier-vscode
fallenwood.vimL
hoovercj.haskell-linter
hoovercj.vscode-settings-cycler
junstyle.php-cs-fixer
justusadam.language-haskell
kisstkondoros.vscode-codemetrics
kumar-harsh.graphql-for-vscode
LaurentTreguier.uncrustify
mrmlnc.vscode-remark
ms-vscode.azure-account
ms-vscode.cpptools
PeterJausovec.vscode-docker
richie5um2.vscode-sort-json
rust-lang.rust
SirTobi.pegjs-language
slb235.vscode-coffeelint
sysoev.language-stylus
timonwong.shellcheck
Tyriar.sort-lines
vscodevim.vim
vtfn.stylint
WallabyJs.quokka-vscode
wayou.vscode-todo-highlight
wwm.better-align
