alefragnani.project-manager
alexdima.vscode-lcov
bungcip.better-toml
christian-kohler.path-intellisense
dbaeumer.vscode-eslint
djabraham.vscode-yaml-validation
donjayamanne.githistory
donjayamanne.python
dracula-theme.theme-dracula
EditorConfig.EditorConfig
eg2.tslint
esbenp.prettier-vscode
fallenwood.vimL
hoovercj.haskell-linter
justusadam.language-haskell
kalitaalexey.vscode-rust
kumar-harsh.graphql-for-vscode
LaurentTreguier.uncrustify
mrmlnc.vscode-remark
ms-vscode.cpptools
naumovs.color-highlight
PeterJausovec.vscode-docker
sysoev.language-stylus
timonwong.shellcheck
Tyriar.sort-lines
vscodevim.vim
vtfn.stylint
WallabyJs.quokka-vscode
wayou.vscode-todo-highlight
wwm.better-align
